hotRoom template/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version: 8                                      |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh true;
snap            true;
addLayers       false;

mergeTolerance 1e-4;

geometry
{
    buildings.stl
    {
        type triSurfaceMesh;
        name buildings;
    }
}

castellatedMeshControls
{
    maxLocalCells       1000000;
    maxGlobalCells      2000000;
    minRefinementCells  0;
    nCellsBetweenLevels 2;
    maxLoadUnbalance    0.10;

    features
    (
    );

    refinementSurfaces
    {
        buildings
        {
            level (1 2);
            patchInfo
            {
                type wall;
            }
        }
    }

    refinementRegions
    {
    }

    resolveFeatureAngle 30;

    locationInMesh (5 2.5 0.5);

    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch        3;
    tolerance           2.0;
    nSolveIter          30;
    nRelaxIter          5;
}

addLayersControls
{
    relativeSizes       true;

    layers
    {
    }

    expansionRatio      1.0;
    finalLayerThickness 0.3;
    minThickness        0.1;
    nGrow               0;

    featureAngle        60;
    nRelaxIter          5;
    nSmoothSurfaceNormals 1;
    nSmoothNormals      3;
    nSmoothThickness    10;

    maxFaceThicknessRatio     0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle        90;

    nBufferCellsNoExtrude     0;
    nLayerIter                50;
}

meshQualityControls
{
    maxNonOrtho         65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave          80;

    minVol              1e-13;
    minTetQuality       -1e15;
    minArea             -1;
    minTwist            0.02;
    minDeterminant      0.001;
    minFaceWeight       0.02;
    minVolRatio         0.01;
    minTriangleTwist    -1;

    nSmoothScale        4;
    errorReduction      0.75;

    relaxed
    {
        maxNonOrtho     75;
    }
}

debug 0;

writeFlags
(
    scalarLevels
    layerSets
    layerFields
);
