hotRoom template/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
/*   Windows 32 and 64 bit porting by blueCAPE: http://www.bluecape.com.pt   *\
|  Based on Windows porting (2.0.x v4) by Symscape: http://www.symscape.com   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    floor
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1692;
        startFace       357551;
    }
    ceiling
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2156;
        startFace       359243;
    }
    fixedWalls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          4058;
        startFace       361399;
    }
    buildings
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          35105;
        startFace       365457;
    }
)

// ************************************************************************* //
