hotRoom template/constant/RASProperties
// constant/RASProperties
simulationType  RAS;

RAS
{
    RASModel        kOmegaSST; 
    
}