hotRoom template/constant/T_hourly_table
(
    (0.0 290.1500)
    (3600.0 289.1500)
    (7200.0 289.1500)
    (10800.0 289.1500)
    (14400.0 288.1500)
    (18000.0 288.1500)
    (21600.0 288.1500)
    (25200.0 288.1500)
    (28800.0 289.1500)
    (32400.0 290.1500)
    (36000.0 292.1500)
    (39600.0 294.1500)
    (43200.0 295.1500)
    (46800.0 297.1500)
    (50400.0 297.1500)
    (54000.0 297.1500)
    (57600.0 295.1500)
    (61200.0 294.1500)
    (64800.0 292.1500)
    (68400.0 290.1500)
    (72000.0 290.1500)
    (75600.0 289.1500)
    (79200.0 288.1500)
    (82800.0 288.1500)
    (86400.0 288.1500)
    (90000.0 287.1500)
    (93600.0 287.1500)
    (97200.0 286.6500)
    (100800.0 286.1500)
    (104400.0 286.1500)
    (108000.0 286.1500)
    (111600.0 286.1500)
    (115200.0 287.1500)
    (118800.0 289.1500)
    (122400.0 292.1500)
    (126000.0 294.1500)
    (129600.0 296.1500)
    (133200.0 297.1500)
    (136800.0 297.1500)
    (140400.0 296.1500)
    (144000.0 295.1500)
    (147600.0 295.1500)
    (151200.0 294.1500)
    (154800.0 292.1500)
    (158400.0 291.1500)
    (162000.0 290.6500)
    (165600.0 290.1500)
    (169200.0 289.1500)
    (172800.0 289.1500)
    (176400.0 289.1500)
    (180000.0 289.1500)
    (183600.0 288.1500)
    (187200.0 288.1500)
    (190800.0 287.1500)
    (194400.0 287.1500)
    (198000.0 287.1500)
    (201600.0 288.1500)
    (205200.0 290.1500)
    (208800.0 293.1500)
    (212400.0 295.1500)
    (216000.0 296.1500)
    (219600.0 298.1500)
    (223200.0 298.1500)
    (226800.0 297.1500)
    (230400.0 296.1500)
    (234000.0 294.1500)
    (237600.0 292.1500)
    (241200.0 290.1500)
    (244800.0 292.1500)
    (248400.0 291.1500)
    (252000.0 290.1500)
    (255600.0 289.1500)
    (259200.0 288.1500)
    (262800.0 288.1500)
    (266400.0 288.1500)
    (270000.0 288.1500)
    (273600.0 288.1500)
    (277200.0 288.1500)
    (280800.0 287.1500)
    (284400.0 287.1500)
    (288000.0 288.1500)
    (291600.0 290.1500)
    (295200.0 292.1500)
    (298800.0 294.1500)
    (302400.0 296.1500)
    (306000.0 293.1500)
    (309600.0 296.1500)
    (313200.0 297.1500)
    (316800.0 296.1500)
    (320400.0 295.1500)
    (324000.0 292.1500)
    (327600.0 291.1500)
    (331200.0 290.1500)
    (334800.0 289.1500)
    (338400.0 288.1500)
    (342000.0 288.1500)
    (345600.0 287.1500)
    (349200.0 287.1500)
    (352800.0 286.1500)
...
)