hotRoom template/constant/U_hourly_table
(
    (0.0 (-0.0000 -0.0000 0.0000))
    (3600.0 (-0.0000 -0.0000 0.0000))
    (7200.0 (-0.0000 -0.0000 0.0000))
    (10800.0 (-0.0000 -0.0000 0.0000))
    (14400.0 (-0.0000 -0.0000 0.0000))
    (18000.0 (-0.0000 -0.0000 0.0000))
    (21600.0 (-0.0000 -0.0000 0.0000))
    (25200.0 (-21.8435 -15.8702 0.0000))
    (28800.0 (-0.0000 -0.0000 0.0000))
    (32400.0 (-0.0000 -0.0000 0.0000))
    (36000.0 (-0.0000 -0.0000 0.0000))
    (39600.0 (-0.0000 -0.0000 0.0000))
    (43200.0 (-0.0000 -0.0000 0.0000))
    (46800.0 (-0.0000 -0.0000 0.0000))
    (50400.0 (-0.0000 -0.0000 0.0000))
    (54000.0 (-1032.6644 7347.7891 0.0000))
    (57600.0 (-1716.2219 -5613.5089 0.0000))
    (61200.0 (131.0027 -1873.4253 0.0000))
    (64800.0 (-28.6430 -4.5366 0.0000))
    (68400.0 (-0.0000 -0.0000 0.0000))
    (72000.0 (-0.0000 -0.0000 0.0000))
    (75600.0 (-0.0000 -0.0000 0.0000))
    (79200.0 (-0.0000 -0.0000 0.0000))
    (82800.0 (-0.0000 -0.0000 0.0000))
    (86400.0 (-0.0000 -0.0000 0.0000))
    (90000.0 (-0.0000 -0.0000 0.0000))
    (93600.0 (-0.0000 -0.0000 0.0000))
    (97200.0 (-0.0000 -0.0000 0.0000))
    (100800.0 (-0.0000 -0.0000 0.0000))
    (104400.0 (-0.0000 -0.0000 0.0000))
    (108000.0 (-0.0000 -0.0000 0.0000))
    (111600.0 (1314.8922 -2188.3481 0.0000))
    (115200.0 (-3144.4912 -554.4586 0.0000))
    (118800.0 (-2629.9067 -1981.7769 0.0000))
    (122400.0 (-2350.8483 -2520.9762 0.0000))
    (126000.0 (3215.6800 1431.7130 0.0000))
    (129600.0 (-3660.7882 1785.4857 0.0000))
    (133200.0 (-5312.0286 371.4532 0.0000))
    (136800.0 (-1667.3257 -6687.2781 0.0000))
    (140400.0 (5237.9544 5817.3377 0.0000))
    (144000.0 (-5045.8862 3153.0196 0.0000))
    (147600.0 (-1598.0697 1204.2319 0.0000))
    (151200.0 (-36.3396 11.1101 0.0000))
    (154800.0 (-0.0000 -0.0000 0.0000))
    (158400.0 (-0.0000 -0.0000 0.0000))
    (162000.0 (-0.0000 -0.0000 0.0000))
    (165600.0 (-0.0000 -0.0000 0.0000))
    (169200.0 (-0.0000 -0.0000 0.0000))
    (172800.0 (-0.0000 -0.0000 0.0000))
    (176400.0 (-0.0000 -0.0000 0.0000))
    (180000.0 (-0.0000 -0.0000 0.0000))
    (183600.0 (-0.0000 -0.0000 0.0000))
    (187200.0 (-0.0000 -0.0000 0.0000))
    (190800.0 (-0.0000 -0.0000 0.0000))
    (194400.0 (-0.0000 -0.0000 0.0000))
    (198000.0 (-1122.7185 2203.4591 0.0000))
    (201600.0 (2712.5634 2276.1109 0.0000))
    (205200.0 (-255.9365 -3660.0625 0.0000))
    (208800.0 (2346.7564 -2516.5881 0.0000))
    (212400.0 (3602.0994 -570.5165 0.0000))
    (216000.0 (-2824.8639 -4034.3238 0.0000))
    (219600.0 (-1881.4119 -6153.8211 0.0000))
    (223200.0 (-3488.3529 5805.5941 0.0000))
    (226800.0 (6100.2253 -4271.4237 0.0000))
    (230400.0 (-4822.9678 -3905.5623 0.0000))
    (234000.0 (1330.3833 1642.8866 0.0000))
    (237600.0 (-36.1401 11.7426 0.0000))
    (241200.0 (-0.0000 -0.0000 0.0000))
    (244800.0 (-0.0000 -0.0000 0.0000))
    (248400.0 (-0.0000 -0.0000 0.0000))
    (252000.0 (-0.0000 -0.0000 0.0000))
    (255600.0 (-0.0000 -0.0000 0.0000))
    (259200.0 (-0.0000 -0.0000 0.0000))
    (262800.0 (-0.0000 -0.0000 0.0000))
    (266400.0 (-0.0000 -0.0000 0.0000))
    (270000.0 (-0.0000 -0.0000 0.0000))
    (273600.0 (-0.0000 -0.0000 0.0000))
    (277200.0 (-0.0000 -0.0000 0.0000))
    (280800.0 (-0.0000 -0.0000 0.0000))
    (284400.0 (2342.6849 -994.4107 0.0000))
    (288000.0 (3038.9659 1106.0931 0.0000))
    (291600.0 (462.8897 3293.6316 0.0000))
    (295200.0 (0.0000 3506.0000 0.0000))
    (298800.0 (-3353.3388 -1563.6876 0.0000))
    (302400.0 (-2523.5964 3230.0561 0.0000))
    (306000.0 (-1717.9458 -4252.0652 0.0000))
    (309600.0 (5660.6750 -998.1297 0.0000))
    (313200.0 (-2942.9869 6933.2426 0.0000))
    (316800.0 (4072.0595 4852.8915 0.0000))
    (320400.0 (1527.5538 -1581.8282 0.0000))
    (324000.0 (-33.9411 33.9411 0.0000))
    (327600.0 (-0.0000 -0.0000 0.0000))
    (331200.0 (-0.0000 -0.0000 0.0000))
    (334800.0 (-0.0000 -0.0000 0.0000))
    (338400.0 (-0.0000 -0.0000 0.0000))
    (342000.0 (-0.0000 -0.0000 0.0000))
    (345600.0 (-0.0000 -0.0000 0.0000))
    (349200.0 (-0.0000 -0.0000 0.0000))
    (352800.0 (-0.0000 -0.0000 0.0000))
...
)