hotRoom template/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |
| \\      /  Field          | OpenFOAM: The Open Source CFD Toolbox
|  \\    /   Operation      | Website:  https://openfoam.org
|   \\  /    And            | Version:  8
|    \\/     Manipulation   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleEnthalpy;
}

pRef            100000;

mixture
{
    specie
    {
        molWeight       28.9;
    }
    thermodynamics
    {
        Cp              1000;
        Hf              0;
    }
    transport
    {
        mu              1.8e-05;
        Pr              0.7;
    }
}

// ************************************************************************* //
