hotRoom template/constant/thermophysicalTransportProperties
thermophysicalTransport
{
    model    thermalDiffusivity;
    Prt     0.85; 
}
