hotRoom template/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
/*   Windows 32 and 64 bit porting by blueCAPE: http://www.bluecape.com.pt   *\
|  Based on Windows porting (2.0.x v4) by Symscape: http://www.symscape.com   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    floor
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    ceiling
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    fixedWalls
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    buildings
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
}

// ************************************************************************* //
