hotRoom template/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
/*   Windows 32 and 64 bit porting by blueCAPE: http://www.bluecape.com.pt   *\
|  Based on Windows porting (2.0.x v4) by Symscape: http://www.symscape.com   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    floor
    {
        type            fixedValue;
        value           uniform 305;
    }
ceiling
{
    type            externalWallHeatFluxTemperature;
    mode            flux;
    q               uniform 0;         
    kappaMethod     fluidThermo;       
    value           uniform 300;       
}

fixedWalls
{
    type            externalWallHeatFluxTemperature;
    mode            flux;
    q               uniform 0;         
    kappaMethod     fluidThermo;       
    value           uniform 300;       
}
buildings
{
    type            externalWallHeatFluxTemperature;
    mode            flux;
    q               uniform 0;         
    kappaMethod     fluidThermo;       
    value           uniform 300;       
}


// ************************************************************************* //
