hotRoom template/0/alphat
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    location "0";
    object alphat;
}
dimensions      [1 -1 -1 0 0 0 0];
internalField   uniform 0;
boundaryField
{    
    floor
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           uniform 0;
    }
    
    ceiling
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           uniform 0;
    }
    
    fixedWalls
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           uniform 0;
    }
    
    buildings
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           uniform 0;
    }
}
