hotRoom template/0/h
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version: 8
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      h;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 300000;

boundaryField
{
    floor
    {
        type    fixedValue;
        value   uniform 300000;
    }

    ceiling
    {
        type    fixedValue;
        value   uniform 300000;
    }

    fixedWalls
    {
        type    fixedValue;
        value   uniform 300000;
    }

    buildings
    {
        type    fixedValue;
        value   uniform 300000;
    }
}


// ************************************************************************* //
