hotRoom template/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
/*   Windows 32 and 64 bit porting by blueCAPE: http://www.bluecape.com.pt   *\
|  Based on Windows porting (2.0.x v4) by Symscape: http://www.symscape.com   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    floor
    {
        type            omegaWallFunction;
        value           uniform 0.1;
    }
    ceiling
    {
        type            fixedValue;
        value           uniform 0.1;
    }
    fixedWalls
    {
        type            omegaWallFunction;
        value           uniform 0.1;
    }
    buildings
    {
        type            omegaWallFunction;
        value           uniform 0.1;
    }    
}


// ************************************************************************* //
