hotRoom template/system/setFieldsDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}

defaultFieldValues
(
    volVectorFieldValue U (0.5 0 0)
    volScalarFieldValue T 300
    volScalarFieldValue k 1e-4 
    volScalarFieldValue omega 0.1
);
regions
(
);